TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_usb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXIS register.
//
//*****************************************************************************
#define USB_RXIS_EP15           0x00008000U  // RX Endpoint 15 Interrupt
#define USB_RXIS_EP14           0x00004000U  // RX Endpoint 14 Interrupt
#define USB_RXIS_EP13           0x00002000U  // RX Endpoint 13 Interrupt
#define USB_RXIS_EP12           0x00001000U  // RX Endpoint 12 Interrupt
#define USB_RXIS_EP11           0x00000800U  // RX Endpoint 11 Interrupt
#define USB_RXIS_EP10           0x00000400U  // RX Endpoint 10 Interrupt
#define USB_RXIS_EP9            0x00000200U  // RX Endpoint 9 Interrupt
#define USB_RXIS_EP8            0x00000100U  // RX Endpoint 8 Interrupt
#define USB_RXIS_EP7            0x00000080U  // RX Endpoint 7 Interrupt
#define USB_RXIS_EP6            0x00000040U  // RX Endpoint 6 Interrupt
#define USB_RXIS_EP5            0x00000020U  // RX Endpoint 5 Interrupt
#define USB_RXIS_EP4            0x00000010U  // RX Endpoint 4 Interrupt
#define USB_RXIS_EP3            0x00000008U  // RX Endpoint 3 Interrupt
#define USB_RXIS_EP2            0x00000004U  // RX Endpoint 2 Interrupt
#define USB_RXIS_EP1            0x00000002U  // RX Endpoint 1 Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXIE register.
//
//*****************************************************************************
#define USB_TXIE_EP15           0x00008000U  // TX Endpoint 15 Interrupt Enable
#define USB_TXIE_EP14           0x00004000U  // TX Endpoint 14 Interrupt Enable
#define USB_TXIE_EP13           0x00002000U  // TX Endpoint 13 Interrupt Enable
#define USB_TXIE_EP12           0x00001000U  // TX Endpoint 12 Interrupt Enable
#define USB_TXIE_EP11           0x00000800U  // TX Endpoint 11 Interrupt Enable
#define USB_TXIE_EP10           0x00000400U  // TX Endpoint 10 Interrupt Enable
#define USB_TXIE_EP9            0x00000200U  // TX Endpoint 9 Interrupt Enable
#define USB_TXIE_EP8            0x00000100U  // TX Endpoint 8 Interrupt Enable
#define USB_TXIE_EP7            0x00000080U  // TX Endpoint 7 Interrupt Enable
#define USB_TXIE_EP6            0x00000040U  // TX Endpoint 6 Interrupt Enable
#define USB_TXIE_EP5            0x00000020U  // TX Endpoint 5 Interrupt Enable
#define USB_TXIE_EP4            0x00000010U  // TX Endpoint 4 Interrupt Enable
#define USB_TXIE_EP3            0x00000008U  // TX Endpoint 3 Interrupt Enable
#define USB_TXIE_EP2            0x00000004U  // TX Endpoint 2 Interrupt Enable
#define USB_TXIE_EP1            0x00000002U  // TX Endpoint 1 Interrupt Enable
#define USB_TXIE_EP0            0x00000001U  // TX and RX Endpoint 0 Interrupt
                                            // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXIE register.
//
//*****************************************************************************
#define USB_RXIE_EP15           0x00008000U  // RX Endpoint 15 Interrupt Enable
#define USB_RXIE_EP14           0x00004000U  // RX Endpoint 14 Interrupt Enable
#define USB_RXIE_EP13           0x00002000U  // RX Endpoint 13 Interrupt Enable
#define USB_RXIE_EP12           0x00001000U  // RX Endpoint 12 Interrupt Enable
#define USB_RXIE_EP11           0x00000800U  // RX Endpoint 11 Interrupt Enable
#define USB_RXIE_EP10           0x00000400U  // RX Endpoint 10 Interrupt Enable
#define USB_RXIE_EP9            0x00000200U  // RX Endpoint 9 Interrupt Enable
#define USB_RXIE_EP8            0x00000100U  // RX Endpoint 8 Interrupt Enable
#define USB_RXIE_EP7            0x00000080U  // RX Endpoint 7 Interrupt Enable
#define USB_RXIE_EP6            0x00000040U  // RX Endpoint 6 Interrupt Enable
#define USB_RXIE_EP5            0x00000020U  // RX Endpoint 5 Interrupt Enable
#define USB_RXIE_EP4            0x00000010U  // RX Endpoint 4 Interrupt Enable
#define USB_RXIE_EP3            0x00000008U  // RX Endpoint 3 Interrupt Enable
#define USB_RXIE_EP2            0x00000004U  // RX Endpoint 2 Interrupt Enable
#define USB_RXIE_EP1            0x00000002U  // RX Endpoint 1 Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IS register.
//
//*****************************************************************************
#define USB_IS_VBUSERR          0x00000080U  // VBUS Error
#define USB_IS_SESREQ           0x00000040U  // SESSION REQUEST
#define USB_IS_DISCON           0x00000020U  // Session Disconnect
#define USB_IS_CONN             0x00000010U  // Session Connect
#define USB_IS_SOF              0x00000008U  // Start of Frame
#define USB_IS_BABBLE           0x00000004U  // Babble Detected
#define USB_IS_RESET            0x00000004U  // RESET Signaling Detected
#define USB_IS_RESUME           0x00000002U  // RESUME Signaling Detected
#define USB_IS_SUSPEND          0x00000001U  // SUSPEND Signaling Detected

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IE register.
//
//*****************************************************************************
#define USB_IE_VBUSERR          0x00000080U  // Enable VBUS Error Interrupt
#define USB_IE_SESREQ           0x00000040U  // Enable Session Request
#define USB_IE_DISCON           0x00000020U  // Enable Disconnect Interrupt
#define USB_IE_CONN             0x00000010U  // Enable Connect Interrupt
#define USB_IE_SOF              0x00000008U  // Enable Start-of-Frame Interrupt
#define USB_IE_BABBLE           0x00000004U  // Enable Babble Interrupt
#define USB_IE_RESET            0x00000004U  // Enable RESET Interrupt
#define USB_IE_RESUME           0x00000002U  // Enable RESUME Interrupt
#define USB_IE_SUSPND           0x00000001U  // Enable SUSPEND Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FRAME register.
//
//*****************************************************************************
#define USB_FRAME_M             0x000007FFU  // Frame Number
#define USB_FRAME_S             0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPIDX register.
//
//*****************************************************************************
#define USB_EPIDX_EPIDX_M       0x0000000FU  // Endpoint Index
#define USB_EPIDX_EPIDX_S       0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TEST register.
//
//*****************************************************************************
#define USB_TEST_FORCEH         0x00000080U  // Force Host Mode
#define USB_TEST_FIFOACC        0x00000040U  // FIFO Access
#define USB_TEST_FORCEFS        0x00000020U  // Force Full-Speed Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO0 register.
//
//*****************************************************************************
#define USB_FIFO0_EPDATA_M      0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO0_EPDATA_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO1 register.
//
//*****************************************************************************
#define USB_FIFO1_EPDATA_M      0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO1_EPDATA_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO2 register.
//
//*****************************************************************************
#define USB_FIFO2_EPDATA_M      0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO2_EPDATA_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO3 register.
//
//*****************************************************************************
#define USB_FIFO3_EPDATA_M      0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO3_EPDATA_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO4 register.
//
//*****************************************************************************
#define USB_FIFO4_EPDATA_M      0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO4_EPDATA_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO5 register.
//
//*****************************************************************************
#define USB_FIFO5_EPDATA_M      0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO5_EPDATA_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO6 register.
//
//*****************************************************************************
#define USB_FIFO6_EPDATA_M      0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO6_EPDATA_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO7 register.
//
//*****************************************************************************
#define USB_FIFO7_EPDATA_M      0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO7_EPDATA_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO8 register.
//
//*****************************************************************************
#define USB_FIFO8_EPDATA_M      0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO8_EPDATA_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO9 register.
//
//*****************************************************************************
#define USB_FIFO9_EPDATA_M      0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO9_EPDATA_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO10 register.
//
//*****************************************************************************
#define USB_FIFO10_EPDATA_M     0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO10_EPDATA_S     0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO11 register.
//
//*****************************************************************************
#define USB_FIFO11_EPDATA_M     0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO11_EPDATA_S     0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO12 register.
//
//*****************************************************************************
#define USB_FIFO12_EPDATA_M     0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO12_EPDATA_S     0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO13 register.
//
//*****************************************************************************
#define USB_FIFO13_EPDATA_M     0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO13_EPDATA_S     0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO14 register.
//
//*****************************************************************************
#define USB_FIFO14_EPDATA_M     0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO14_EPDATA_S     0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FIFO15 register.
//
//*****************************************************************************
#define USB_FIFO15_EPDATA_M     0xFFFFFFFFUL  // Endpoint Data
#define USB_FIFO15_EPDATA_S     0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DEVCTL register.
//
//*****************************************************************************
#define USB_DEVCTL_DEV          0x00000080U  // Device Mode
#define USB_DEVCTL_FSDEV        0x00000040U  // Full-Speed Device Detected
#define USB_DEVCTL_LSDEV        0x00000020U  // Low-Speed Device Detected
#define USB_DEVCTL_VBUS_M       0x00000018U  // VBUS Level
#define USB_DEVCTL_VBUS_NONE    0x00000000U  // Below SessionEnd
#define USB_DEVCTL_VBUS_SEND    0x00000008U  // Above SessionEnd, below AValid
#define USB_DEVCTL_VBUS_AVALID  0x00000010U  // Above AValid, below VBUSValid
#define USB_DEVCTL_VBUS_VALID   0x00000018U  // Above VBUSValid
#define USB_DEVCTL_HOST         0x00000004U  // Host Mode
#define USB_DEVCTL_HOSTREQ      0x00000002U  // Host Request
#define USB_DEVCTL_SESSION      0x00000001U  // Session Start/End

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFIFOSZ register.
//
//*****************************************************************************
#define USB_TXFIFOSZ_DPB        0x00000010U  // Double Packet Buffer Support
#define USB_TXFIFOSZ_SIZE_M     0x0000000FU  // Max Packet Size
#define USB_TXFIFOSZ_SIZE_8     0x00000000U  // 8
#define USB_TXFIFOSZ_SIZE_16    0x00000001U  // 16
#define USB_TXFIFOSZ_SIZE_32    0x00000002U  // 32
#define USB_TXFIFOSZ_SIZE_64    0x00000003U  // 64
#define USB_TXFIFOSZ_SIZE_128   0x00000004U  // 128
#define USB_TXFIFOSZ_SIZE_256   0x00000005U  // 256
#define USB_TXFIFOSZ_SIZE_512   0x00000006U  // 512
#define USB_TXFIFOSZ_SIZE_1024  0x00000007U  // 1024
#define USB_TXFIFOSZ_SIZE_2048  0x00000008U  // 2048

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFIFOSZ register.
//
//*****************************************************************************
#define USB_RXFIFOSZ_DPB        0x00000010U  // Double Packet Buffer Support
#define USB_RXFIFOSZ_SIZE_M     0x0000000FU  // Max Packet Size
#define USB_RXFIFOSZ_SIZE_8     0x00000000U  // 8
#define USB_RXFIFOSZ_SIZE_16    0x00000001U  // 16
#define USB_RXFIFOSZ_SIZE_32    0x00000002U  // 32
#define USB_RXFIFOSZ_SIZE_64    0x00000003U  // 64
#define USB_RXFIFOSZ_SIZE_128   0x00000004U  // 128
#define USB_RXFIFOSZ_SIZE_256   0x00000005U  // 256
#define USB_RXFIFOSZ_SIZE_512   0x00000006U  // 512
#define USB_RXFIFOSZ_SIZE_1024  0x00000007U  // 1024
#define USB_RXFIFOSZ_SIZE_2048  0x00000008U  // 2048

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFIFOADD
// register.
//
//*****************************************************************************
#define USB_TXFIFOADD_ADDR_M    0x000001FFU  // Transmit/Receive Start Address
#define USB_TXFIFOADD_ADDR_S    0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFIFOADD
// register.
//
//*****************************************************************************
#define USB_RXFIFOADD_ADDR_M    0x000001FFU  // Transmit/Receive Start Address
#define USB_RXFIFOADD_ADDR_S    0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_CONTIM register.
//
//*****************************************************************************
#define USB_CONTIM_WTCON_M      0x000000F0U  // Connect Wait
#define USB_CONTIM_WTID_M       0x0000000FU  // Wait ID
#define USB_CONTIM_WTCON_S      4U
#define USB_CONTIM_WTID_S       0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VPLEN register.
//
//*****************************************************************************
#define USB_VPLEN_VPLEN_M       0x000000FFU  // VBUS Pulse Length
#define USB_VPLEN_VPLEN_S       0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_FSEOF register.
//
//*****************************************************************************
#define USB_FSEOF_FSEOFG_M      0x000000FFU  // Full-Speed End-of-Frame Gap
#define USB_FSEOF_FSEOFG_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_LSEOF register.
//
//*****************************************************************************
#define USB_LSEOF_LSEOFG_M      0x000000FFU  // Low-Speed End-of-Frame Gap
#define USB_LSEOF_LSEOFG_S      0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR0
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR0_ADDR_M  0x0000007FU  // Device Address
#define USB_TXFUNCADDR0_ADDR_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR0
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR0_ADDR_M   0x0000007FU  // Hub Address
#define USB_TXHUBADDR0_ADDR_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT0
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT0_PORT_M   0x0000007FU  // Hub Port
#define USB_TXHUBPORT0_PORT_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR1
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR1_ADDR_M  0x0000007FU  // Device Address
#define USB_TXFUNCADDR1_ADDR_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR1
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR1_ADDR_M   0x0000007FU  // Hub Address
#define USB_TXHUBADDR1_ADDR_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT1
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT1_PORT_M   0x0000007FU  // Hub Port
#define USB_TXHUBPORT1_PORT_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFUNCADDR1
// register.
//
//*****************************************************************************
#define USB_RXFUNCADDR1_ADDR_M  0x0000007FU  // Device Address
#define USB_RXFUNCADDR1_ADDR_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBADDR1
// register.
//
//*****************************************************************************
#define USB_RXHUBADDR1_ADDR_M   0x0000007FU  // Hub Address
#define USB_RXHUBADDR1_ADDR_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBPORT1
// register.
//
//*****************************************************************************
#define USB_RXHUBPORT1_PORT_M   0x0000007FU  // Hub Port
#define USB_RXHUBPORT1_PORT_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR2
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR2_ADDR_M  0x0000007FU  // Device Address
#define USB_TXFUNCADDR2_ADDR_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR2
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR2_ADDR_M   0x0000007FU  // Hub Address
#define USB_TXHUBADDR2_ADDR_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT2
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT2_PORT_M   0x0000007FU  // Hub Port
#define USB_TXHUBPORT2_PORT_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXFUNCADDR2
// register.
//
//*****************************************************************************
#define USB_RXFUNCADDR2_ADDR_M  0x0000007FU  // Device Address
#define USB_RXFUNCADDR2_ADDR_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBADDR2
// register.
//
//*****************************************************************************
#define USB_RXHUBADDR2_ADDR_M   0x0000007FU  // Hub Address
#define USB_RXHUBADDR2_ADDR_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXHUBPORT2
// register.
//
//*****************************************************************************
#define USB_RXHUBPORT2_PORT_M   0x0000007FU  // Hub Port
#define USB_RXHUBPORT2_PORT_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXFUNCADDR3
// register.
//
//*****************************************************************************
#define USB_TXFUNCADDR3_ADDR_M  0x0000007FU  // Device Address
#define USB_TXFUNCADDR3_ADDR_S  0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBADDR3
// register.
//
//*****************************************************************************
#define USB_TXHUBADDR3_ADDR_M   0x0000007FU  // Hub Address
#define USB_TXHUBADDR3_ADDR_S   0U

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXHUBPORT3
// register.
//
//*****************************************************************************
#define USB_TXHUBPORT3_PORT_M   0x0000007FU  // Hub Port
#define USB_TXHUBPORT3_PORT_S   0U

